Revit 2027 API
DuctSettings.FittingAngleUsage Property
 Determine how to use fitting angle during duct layout or modifying layout.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FittingAngleUsage FittingAngleUsage { get; set; }
Public Property FittingAngleUsage As FittingAngleUsage
	Get
	Set
public:
property FittingAngleUsage FittingAngleUsage {
	FittingAngleUsage get ();
	void set (FittingAngleUsage value);
}
member FittingAngleUsage : FittingAngleUsage with get, set
Property Value
FittingAngleUsage
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace